SvetlAl/STM32_LIN_FDCAN_TOOL/Firmware/Keil/template/Core/src/USB_CDC/stm32h7xx_usbdfs_cdc.c
/****************************************************************
* STM32H7XX
* USB OTG HS FS device (CDC) implementation
*
* Alex Svetlichnyy 2023 svetlal@outlook.com
*****************************************************************/

#include "device_model.h" /* used for circular buffer defs */
#ifdef USB_PERIPH_HS_IN_FS_MODE

#include <USB_CDC/stm32h7xx_usbdfs_cdc.h>
#include <USB_CDC/stm32h7xx_usbdfs_macros.h>
#include "USB_CDC/usb_cdc_desc.h"
#include "stm32h730xx.h"

#define UNUSED(x)                     (void)(x)

/****************************************************************
 * 		RX buffers for Endpoint structure
 * 		May be customized or exluded
*****************************************************************/

#define RX_BUFFER_EP0_SIZE 8U 										/* Enough to set linecoding */
#define RX_BUFFER_EP1_SIZE 128U

static uint8_t rxBufferEp0[RX_BUFFER_EP0_SIZE]; /* Recieved data is stored here after application reads DFIFO. RX FIFO is shared */
static uint8_t rxBufferEp1[RX_BUFFER_EP1_SIZE]; /* Recieved data is stored here after application reads DFIFO. RX FIFO is shared */

/****************************************************************
 * 		LineCoding
 * 		The application has to set linecoding
 * 		according to host requests
*****************************************************************/

static uint8_t lineCoding[CDC_LINE_CODING_LENGTH]={
	0x00, 
	0x00,	/* 0x01, */
	0x00, /* 0xC2, */
	0x00, /* 0X0001C200 -= 115200 Kb/s */
	0x00,
	0x00,
	0x00	/* 0x08 */
};


static uint32_t device_state = DEVICE_STATE_DEFAULT; /* Device state */
//static uint32_t getdevstat(){ return device_state;}

EndPointStruct EndPoint[EP_COUNT];	/* All the Enpoints are included in this array */

static USB_setup_req_data setup_pkt_data; /* Setup Packet var */

/****************************************************************
 * 		static functions' declarations
*****************************************************************/

static void enumerate_Reset(void);
static void enumerate_Setup(void);
// void initEndPoints(void); -> static

static void read_Fifo(uint8_t dfifo, uint16_t len);

/* Endpoint functions */
static uint32_t USB_CDC_setTxBuffer(uint8_t EPnum, uint8_t *txBuff, uint16_t len);

static uint32_t USB_CDC_transferRXCallback_EP0(uint32_t param);

static uint32_t USB_CDC_transmit_scheduler(void); /* this function monitors if any data is pending in circ buffer or whatever */
static uint32_t USB_FlushTxFifo(uint32_t EPnum, uint32_t timeout);
static uint32_t USB_FlushRxFifo(uint32_t timeout);

static void write_to_circBuffer(uint8_t *buf, uint16_t len);

/* Device state */
static inline void set_device_status(eDeviceState state);


/* FIFO handlers */
static inline uint32_t DTFXSTS_timeout(uint8_t Epnum, uint32_t dtxfsts_val);

static inline uint32_t check_free_space_inFifo(uint8_t dfifo, uint32_t space);

static inline uint32_t is_epena_stuck(uint8_t EPnum);

static inline uint32_t recovery_routine_EP_IN (uint8_t EPnum);

static uint32_t write_Fifo(uint8_t dfifo, uint8_t *src, uint16_t len);

static void read_Setup_Fifo(void);


/* Init EP */
static void initEndPoints(void);

static inline void set_FIFOs_sz(void);

/* EP routine */
static inline uint32_t is_tx_ep_fifo_ready(uint8_t EPnum, uint32_t param);

static inline void toggle_Rx_EP_Status(uint8_t EPnum, uint8_t param);

static uint32_t send_zlp(uint8_t EPnum);


/***************************************************
*
* 		Circular buffer example
* 		Customize it in the way you need
*
***************************************************/

static uint8_t circBufferTx[CIRC_BUFFER_TX_SIZE];
static uint16_t writePtrTxCbuf = 0U;
static uint16_t readPtrTxCbuf = 0U;


static inline uint32_t is_circBuffer_empty(){
	if(writePtrTxCbuf == readPtrTxCbuf) return 0;
	else return 1;
}

static inline uint32_t get_circBuffer_freeSize(){
	if(is_circBuffer_empty() ==0) return CIRC_BUFFER_TX_SIZE;
	uint32_t gap = (writePtrTxCbuf > readPtrTxCbuf) ? (uint32_t)(writePtrTxCbuf - readPtrTxCbuf) : (uint32_t)(readPtrTxCbuf - writePtrTxCbuf);

	uint32_t freeSz = (writePtrTxCbuf > readPtrTxCbuf) ? CIRC_BUFFER_TX_SIZE - gap : CIRC_BUFFER_TX_SIZE - gap;
	return freeSz;
}


void write_to_circBuffer(uint8_t *buf, uint16_t len){
	
	if((writePtrTxCbuf + len) >= CIRC_BUFFER_TX_SIZE){
		uint32_t write_tail = (uint32_t)((CIRC_BUFFER_TX_SIZE) - writePtrTxCbuf);
		memcpy(&circBufferTx[writePtrTxCbuf], buf, write_tail);
		memcpy(&circBufferTx[0], (buf+write_tail), (len - write_tail));		
		writePtrTxCbuf =  (uint16_t)((writePtrTxCbuf + len) - (uint16_t)CIRC_BUFFER_TX_SIZE);
	}
	else{
		memcpy(&circBufferTx[writePtrTxCbuf], buf, len);		
		writePtrTxCbuf = (uint16_t)(writePtrTxCbuf + len);
	}
}

/**
* brief  Get a string from the Circular buffer
* param  Maximum length to get. For Example, if len=256, the function returns 256 length string index, if used space > 256.
* param  If used space < 256, the function returns used space.
* retval First character's index and length
*/
static circBufferAddress read_circBuffer(uint16_t len){
	circBufferAddress result;
	if(is_circBuffer_empty() == 0){
		result.index = 0;
		result.len = 0;
		return result;
	}
	uint16_t writtenSize = (uint16_t)(CIRC_BUFFER_TX_SIZE - get_circBuffer_freeSize());
	len = (writtenSize > len) ? len : writtenSize;
	result.index = readPtrTxCbuf;
	
	if((readPtrTxCbuf + len) >= (CIRC_BUFFER_TX_SIZE)){
		uint16_t read_tail = (uint16_t)((CIRC_BUFFER_TX_SIZE) - readPtrTxCbuf);
		result.len = read_tail;
		readPtrTxCbuf = 0;		
	}
	else{
		uint16_t read_tail = len;
		result.len = read_tail;
		readPtrTxCbuf = (uint16_t)(readPtrTxCbuf + len);
	}
	return result;
}

/***************************************************
*
* 	Initialization functions
*
***************************************************/

/**
* brief  fill endpoint structures with initial data
* param  
* param 
* retval 
*/
static void initEndPoints(){
	for(uint32_t i = 0; i < EP_COUNT; i++){
		EndPoint[i].statusRx = EP_READY;
		EndPoint[i].statusTx = EP_READY;
		EndPoint[i].rxCounter = 0;
		EndPoint[i].txCounter = 0;
	//	EndPoint[i].errCode = 0;
		EndPoint[i].setTxBuffer = &USB_CDC_setTxBuffer;
		EndPoint[i].txCallBack = &USB_CDC_transferTXCallback;
				
