SvetlAl/STM32_LIN_FDCAN_TOOL/Firmware/Keil/template/Core/src/USB_CDC/stm32h7xx_usbdfs_cdc.c
		/* EndPoint 0 */
		if(i==0){
			EndPoint[i].rxBuffer_ptr = rxBufferEp0;  /* RX Buffer for EP0 */
			EndPoint[i].rxCallBack = &USB_CDC_transferRXCallback_EP0;
		}
		/* EndPoint 1 */
		else if(i==1){
			EndPoint[i].rxBuffer_ptr = rxBufferEp1;	/* RX Buffer for EP1 */
			EndPoint[i].rxCallBack = &USB_CDC_transferRXCallback_EP1;
		}
		else{
			EndPoint[i].rxBuffer_ptr = 0; /* TODO add EP2 support */
		}
	}	
}

/**
* brief  Set RX and TX FIFO size and offset for each EP
* param
* param
* retval
*/
static inline void set_FIFOs_sz(){
	USB1_OTG_HS->GRXFSIZ = RX_FIFO_SIZE; /* all EPs RX FIFO RAM size */
	USB1_OTG_HS->DIEPTXF0_HNPTXFSIZ = ((TX_EP0_FIFO_SIZE) << 16) | RX_FIFO_SIZE; /* EP0 TX FIFO RAM size */
	USB1_OTG_HS->DIEPTXF[0] = ((TX_EP1_FIFO_SIZE) << 16) | (RX_FIFO_SIZE+TX_EP0_FIFO_SIZE); /* EP1 TX FIFO RAM size */
//	USB_OTG_FS->DIEPTXF[1] = ((TX_EP2_FIFO_SIZE) << 16) | (RX_FIFO_SIZE+TX_EP0_FIFO_SIZE+TX_EP1_FIFO_SIZE); 				/* EP2 TX FIFO RAM size */
//	USB_OTG_FS->DIEPTXF[2] = ((TX_EP3_FIFO_SIZE) << 16) | (RX_FIFO_SIZE+TX_EP0_FIFO_SIZE+TX_EP1_FIFO_SIZE+TX_EP2_FIFO_SIZE); /* EP3 TX FIFO RAM size */

	for(uint32_t i = 1; i < 0x10 ; i++){
		USB1_OTG_HS->DIEPTXF[i] = 0;
	}
}

/**
* brief  Init GPIO to use USB OTG for stm32f205/207
* param
* param
* retval
* A11 (DM), A12 (DP), A9(VBUS)
*/
void USB_OTG_HS_init_pinout(){
	GPIOA->MODER &= ~GPIO_MODER_MODE11;
	GPIOA->MODER |= GPIO_MODER_MODE11_0;
	GPIOA->MODER |= GPIO_MODER_MODE11_1;
	GPIOA->OSPEEDR &= ~GPIO_OSPEEDR_OSPEED11;
//	GPIOA->OSPEEDR |= GPIO_OSPEEDR_OSPEED11;
	GPIOA->PUPDR &= ~GPIO_PUPDR_PUPD11;
//	GPIOA->AFR[1] |= GPIO_AFRH_AFSEL11_1;
//	GPIOA->AFR[1] |= GPIO_AFRH_AFSEL11_3;
	
	GPIOA->MODER &= ~GPIO_MODER_MODE12;
	GPIOA->MODER |= GPIO_MODER_MODE12_0;
	GPIOA->MODER |= GPIO_MODER_MODE12_1;
	GPIOA->OSPEEDR &= ~GPIO_OSPEEDR_OSPEED12;
//	GPIOA->OSPEEDR |= GPIO_OSPEEDR_OSPEED12;
	GPIOA->PUPDR &= ~GPIO_PUPDR_PUPD12;
//	GPIOA->AFR[1] |= GPIO_AFRH_AFSEL12_1;
//	GPIOA->AFR[1] |= GPIO_AFRH_AFSEL12_3;
	
	GPIOA->MODER &= ~GPIO_MODER_MODE9;
	GPIOA->MODER |=  GPIO_MODER_MODE9_0;
	GPIOA->MODER |=  GPIO_MODER_MODE9_1;
	GPIOA->PUPDR &= ~GPIO_PUPDR_PUPD9;

}

/**
* brief  Init general settings of USB_OTG periph
* param
* param
* retval
*/
void USB_OTG_HS_init_device(){
	
	device_state = DEVICE_STATE_DEFAULT;
	
	USB_OTG_PWRCLK->PCGCR |= USB_OTG_PCGCR_STPPCLK; ////++++++++
	
	
	USB1_OTG_HS->GAHBCFG |= USB_OTG_GAHBCFG_GINT;
	
	USB1_OTG_HS->GINTMSK = USB_OTG_GINTMSK_USBRST;
	/*
	USB1_OTG_HS->GINTMSK = USB_OTG_GINTMSK_USBRST |
												USB_OTG_GINTMSK_SOFM   |
												USB_OTG_GINTMSK_OEPINT |
												USB_OTG_GINTMSK_IEPINT |
												USB_OTG_GINTSTS_RXFLVL;
	*/
	
	/* Enable Global Interrupt for Reset, IN, OUT, RX not empty */
	
	USB_OTG_PWRCLK->PCGCR = 0x00;
	PWR->CR3 |= PWR_CR3_USB33DEN;
	
	USB1_OTG_HS->GCCFG = USB_OTG_GCCFG_PWRDWN | USB_OTG_GCCFG_VBDEN; /* Power up */
	USB_OTG_DEVICE->DCTL = USB_OTG_DCTL_SDIS;  /* Soft disconnect */
	
	

	
	USB1_OTG_HS->GUSBCFG =  USB_OTG_GUSBCFG_FDMOD | USB_OTG_GUSBCFG_PHYSEL; /* Force device mode */
	USB1_OTG_HS->GUSBCFG &= ~(uint32_t)(0x0FUL << 10UL) ;  /* USB turnaround time (according to AHB and ReferenceManual) */
	USB1_OTG_HS->GUSBCFG |= (0x6 << 10);

	set_FIFOs_sz();
	/* Init  EP0: 1 Packet, 3*8 bytes */
	USB_EP_OUT(0)->DOEPTSIZ = 0;
	USB_EP_OUT(0)->DOEPTSIZ |= (USB_OTG_DOEPTSIZ_PKTCNT & (1 << 19)); /* This field is decremented to zero after a packet is written into the RxFIFO */
	USB_EP_OUT(0)->DOEPTSIZ |= USB_CDC_MAX_PACKET_SIZE; /* Set in descriptor  */
	USB_EP_OUT(0)->DOEPTSIZ |= USB_OTG_DOEPTSIZ_STUPCNT;  /* STUPCNT==0x11 means, EP can receive 3 packets. RM says to set STUPCNT = 3*/
	USB_EP_OUT(0)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA); /* Clear NAK and enable EP0 */

	USB_OTG_DEVICE->DCFG |= USB_OTG_DCFG_DSPD_Msk;  /* Device speed - FS */
	USB1_OTG_HS->GINTSTS = 0xFFFFFFFF; /* Reset Global Interrupt status */
	USB_OTG_DEVICE->DCTL &= ~USB_OTG_DCTL_SDIS;   /* Soft connect */
	initEndPoints();
	

	NVIC_SetPriority(OTG_HS_IRQn, USB_FS_IRQ_P);
	NVIC_EnableIRQ(OTG_HS_IRQn);
}
static void on_reset(){
	USB_FlushTxFifo(0x10, FLUSH_FIFO_TIMEOUT);
	USB_FlushRxFifo(FLUSH_FIFO_TIMEOUT);

	USB1_OTG_HS->GAHBCFG |= USB_OTG_GAHBCFG_GINT;
	
	USB1_OTG_HS->GINTMSK = USB_OTG_GINTMSK_USBRST |
												USB_OTG_GINTMSK_SOFM   |
												USB_OTG_GINTMSK_OEPINT |
												USB_OTG_GINTMSK_IEPINT |
												USB_OTG_GINTSTS_RXFLVL;
	
		for (uint8_t i = 0U; i < 2; i++){
        USB_EP_IN(i)->DIEPINT = 0xFB7FU;
        USB_EP_IN(i)->DIEPCTL &= ~USB_OTG_DIEPCTL_STALL;
        USB_EP_OUT(i)->DOEPINT = 0xFB7FU;
        USB_EP_OUT(i)->DOEPCTL &= ~USB_OTG_DOEPCTL_STALL;
        USB_EP_OUT(i)->DOEPCTL |= USB_OTG_DOEPCTL_SNAK;}
		
	
	/* Enable Global Interrupt for Reset, IN, OUT, RX not empty */
	
	USB_OTG_PWRCLK->PCGCR = 0x00;
	PWR->CR3 |= PWR_CR3_USB33DEN;

	USB1_OTG_HS->GUSBCFG =  USB_OTG_GUSBCFG_FDMOD | USB_OTG_GUSBCFG_PHYSEL; /* Force device mode */
	USB1_OTG_HS->GUSBCFG &= ~(uint32_t)(0x0FUL << 10UL) ;  /* USB turnaround time (according to AHB and ReferenceManual) */
	USB1_OTG_HS->GUSBCFG |= (0x6 << 10);

	set_FIFOs_sz();
	/* Init  EP0: 1 Packet, 3*8 bytes */
	USB_EP_OUT(0)->DOEPTSIZ = 0;
	USB_EP_OUT(0)->DOEPTSIZ |= (USB_OTG_DOEPTSIZ_PKTCNT & (1 << 19)); /* This field is decremented to zero after a packet is written into the RxFIFO */
	USB_EP_OUT(0)->DOEPTSIZ |= USB_CDC_MAX_PACKET_SIZE; /* Set in descriptor  */
	USB_EP_OUT(0)->DOEPTSIZ |= USB_OTG_DOEPTSIZ_STUPCNT;  /* STUPCNT==0x11 means, EP can receive 3 packets. RM says to set STUPCNT = 3*/
	USB_EP_OUT(0)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA); /* Clear NAK and enable EP0 */
	
	USB1_OTG_HS->GINTMSK = USB_OTG_GINTMSK_USBRST |
												USB_OTG_GINTMSK_SOFM   |
												USB_OTG_GINTMSK_OEPINT |
												USB_OTG_GINTMSK_IEPINT |
												USB_OTG_GINTSTS_RXFLVL;
			
