SvetlAl/STM32_LIN_FDCAN_TOOL/Firmware/Keil/template/Core/src/USB_CDC/stm32h7xx_usbdfs_cdc.c
	USB1_OTG_HS->GINTSTS = 0xFFFFFFFF; /* Reset Global Interrupt status */
	initEndPoints();
}

/***************************************************
*
* 	Miscellaneous service functions
*
***************************************************/
/**
* brief  Send Zero Length Packet
* param
* param
* retval OK/FAILED
*/

static uint32_t send_zlp(uint8_t EPnum){
	USB_EP_IN(EPnum)->DIEPTSIZ = 0;
	USB_EP_IN(EPnum)->DIEPTSIZ = ((USB_OTG_DIEPTSIZ_PKTCNT_Msk & ((1) << USB_OTG_DIEPTSIZ_PKTCNT_Pos))); /* One Packet */
	USB_EP_IN(EPnum)->DIEPTSIZ &= ~USB_OTG_DIEPTSIZ_XFRSIZ_Msk;  /* Zero Length */
	USB_EP_IN(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_CNAK | USB_OTG_DIEPCTL_EPENA;

	while(USB_EP_IN(EPnum)->DIEPTSIZ!=0){} /* make sure zlp is gone */

	USB_EP_OUT(EPnum)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);
	clear_USB_device_status(DEVICE_STATE_TX_PR);

	EndPoint[EPnum].statusTx = EP_READY;
	USB_EP_IN(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_SNAK;

	if(is_epena_stuck(EPnum) == EP_OK){
		return EP_OK;
	}
	else return EP_FAILED;
}

 /**
 * brief  Flush TxFifo
 * param  Fifo number, 10 = all Tx Fifos,
 * param  timeout (default FLUSH_FIFO_TIMEOUT)
 * retval 1 = OK, 0 = Failed
 */
/*
uint32_t USB_FlushTxFifo(uint32_t EPnum, uint32_t timeout){
	uint32_t count = 0;
	USB1_OTG_HS->GRSTCTL = (USB_OTG_GRSTCTL_TXFFLSH | (EPnum << 6));
	do{
		if (++count > timeout){
			return EP_FAILED;
		}
	}
	while ((USB1_OTG_HS->GRSTCTL & USB_OTG_GRSTCTL_TXFFLSH) == USB_OTG_GRSTCTL_TXFFLSH);
   return EP_OK;
}

static 
	*/
uint32_t USB_FlushTxFifo(uint32_t EPnum, uint32_t timeout){
  __IO uint32_t count = 0U;
  do{
    count++;
    if (count > timeout){
      return EP_FAILED;
    }
  } while ((USB1_OTG_HS->GRSTCTL & USB_OTG_GRSTCTL_AHBIDL) == 0U);count = 0U;
  USB1_OTG_HS->GRSTCTL = (USB_OTG_GRSTCTL_TXFFLSH | (EPnum << 6));
	do{
    count++;
    if (count > timeout){
      return EP_FAILED;
    }
  } while ((USB1_OTG_HS->GRSTCTL & USB_OTG_GRSTCTL_TXFFLSH) == USB_OTG_GRSTCTL_TXFFLSH);
  return EP_OK;
}
 /**
 * brief  Flush RxFifo
 * param  timeout (default FLUSH_FIFO_TIMEOUT)
 * param
 * retval 1 = OK, 0 = Failed
 */
/*
uint32_t USB_FlushRxFifo(uint32_t timeout){
	uint32_t count = 0;
	USB1_OTG_HS->GRSTCTL = USB_OTG_GRSTCTL_RXFFLSH;
	do{
		if (++count > timeout){
			return EP_FAILED;
		}
	}
	while ((USB1_OTG_HS->GRSTCTL & USB_OTG_GRSTCTL_RXFFLSH) == USB_OTG_GRSTCTL_RXFFLSH);

	return EP_OK;
}
*/
uint32_t USB_FlushRxFifo(uint32_t timeout){
	UNUSED(timeout);
  __IO uint32_t count = 0U;
  do{
    count++;
    if (count > 200000U){
      return EP_FAILED;
    }
  } while ((USB1_OTG_HS->GRSTCTL & USB_OTG_GRSTCTL_AHBIDL) == 0U);

  /* Flush RX Fifo */
  count = 0U;
  USB1_OTG_HS->GRSTCTL = USB_OTG_GRSTCTL_RXFFLSH;

  do{
    count++;
    if (count > 200000U){
      return EP_FAILED;
    }
  } while ((USB1_OTG_HS->GRSTCTL & USB_OTG_GRSTCTL_RXFFLSH) == USB_OTG_GRSTCTL_RXFFLSH);

  return EP_OK;
}



 /**
 * brief  Change EP OUT status
 * brief
 * param  EP number
 * param  READY/BUSY
 * retval
 */

static inline void toggle_Rx_EP_Status(uint8_t EPnum, uint8_t param){
	if(EndPoint[EPnum].statusRx == param) return;
 	EndPoint[EPnum].statusRx = param; /* toggle status*/

	if(param==EP_READY){
		USB_EP_OUT(EPnum)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);
 	}
		else{
			USB_EP_OUT(EPnum)->DOEPCTL |= USB_OTG_DOEPCTL_SNAK;
		}
}


/***************************************************
*
* 		DFIFO read/write
*
***************************************************/
/**
* brief  Read Setup Packet EP0
* param  
* param 
* retval 
*/
static void read_Setup_Fifo(){
	/* Read Setup packet. Always 8 bytes */
	setup_pkt_data.raw_data[0] = USB_OTG_DFIFO(0);
	setup_pkt_data.raw_data[1] = USB_OTG_DFIFO(0);
}
	
/**
* brief  Read data from DFIFO (into rxBufferMain[RX_BUFFER_MAIN_SIZE] for EP1)
* brief  If you don't handle received data on OEPINT event, there is a risk that the data will be lost
* param  EP number, length
* param 
* retval 
*/
void read_Fifo(uint8_t dfifo, uint16_t len){
	uint16_t residue = (len%4==0) ? 0 : 1 ;
	uint32_t block_cnt = (uint32_t)((len/4) + residue);
	uint8_t *tmp_ptr = EndPoint[dfifo].rxBuffer_ptr;

	/* If unprocessed data length exceeds Max buffer length, it has to be rewritten */
	if((dfifo == 1) & ((EndPoint[dfifo].rxCounter + len) > RX_BUFFER_EP1_SIZE)){
		EndPoint[dfifo].rxBuffer_ptr = rxBufferEp1;
		EndPoint[dfifo].rxCounter = 0;
	}
	/********************************************************************************/
	
	for (uint32_t i = 0; i < block_cnt; i++){
		*(uint32_t *)(void *)EndPoint[dfifo].rxBuffer_ptr = USB_OTG_DFIFO(0);
		EndPoint[dfifo].rxBuffer_ptr = EndPoint[dfifo].rxBuffer_ptr + 4;
	}

	if(dfifo!=0){	
		USB_EP_OUT(dfifo)->DOEPTSIZ = 0;			
		USB_EP_OUT(dfifo)->DOEPTSIZ |= (USB_OTG_DOEPTSIZ_PKTCNT & (DOEPT_TRANSFER_PCT << USB_OTG_DOEPTSIZ_PKTCNT_Pos)); 
		USB_EP_OUT(dfifo)->DOEPTSIZ |= DOEPT_TRANSFER_SIZE; 
		USB_EP_OUT(dfifo)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);
	}
	
	EndPoint[dfifo].rxBuffer_ptr = tmp_ptr + len;
	EndPoint[dfifo].rxCounter = (uint16_t)(EndPoint[dfifo].rxCounter + len);
}


/**
* brief  Write data into DFIFO
* param  EP number, TX Buffer, length 
* param 
* retval OK or FAILED (in case DFIFO overrun, for better details watch my youtube)
*/
static uint32_t write_Fifo(uint8_t dfifo, uint8_t *src, uint16_t len){ 

	uint16_t residue = (len%4==0) ? 0 : 1;
	uint32_t block_cnt = (uint32_t)((len/4) + residue);
	uint32_t dtxfsts_sample = USB_EP_IN(dfifo)->DTXFSTS;
		
	for (uint32_t i = 0; (i < block_cnt) ; i++){
		USB_OTG_DFIFO(dfifo) = *((uint32_t *)(void *)src);
		src+=4;	
	} 

	if(DTFXSTS_timeout(dfifo, dtxfsts_sample)==EP_OK){
		EndPoint[dfifo].txBuffer_ptr = EndPoint[dfifo].txBuffer_ptr + len;
		EndPoint[dfifo].txCounter = (uint16_t)(EndPoint[dfifo].txCounter - len);
		
		return EP_OK;	
	}
	
	else {
		return EP_FAILED;
	} 
}


/***************************************************
*
* 		EndPoints' Callbacks
*
***************************************************/

/**
* brief  Continue TX transaction for a certain EP
* brief  check Endpoint TX status 
* param  EP number
* param 
* retval 
*/
uint32_t USB_CDC_transferTXCallback(uint8_t EPnum){ 
	
	if(EndPoint[EPnum].statusTx == EP_BUSY){
		USB_EP_OUT(EPnum)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);	
		return EP_FAILED;
	}
	/************** EP is ready *****************/	
	/* No data in TX Buffer */
	if(EndPoint[EPnum].txCounter==0){
		if(EndPoint[EPnum].statusTx == EP_ZLP){			
			if(send_zlp(EPnum) == EP_OK){
				return EP_OK;
			}
			else return EP_FAILED;
		}
		USB_EP_OUT(EPnum)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);	
		clear_USB_device_status(DEVICE_STATE_TX_PR);			
		EndPoint[EPnum].statusTx = EP_READY;
		USB_EP_IN(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_SNAK;
		return EP_OK;
	}
	
	/************** Calculate packet(s) count *****************/
	uint16_t max_tx_sz; // max transfer size considering TX FIFO size
	if(EPnum==0){
		max_tx_sz = MAX_CDC_EP0_TX_SIZ;
	}
	else max_tx_sz = MAX_CDC_EP1_TX_SIZ;
	
	/* if FIFO size is 64 bytes, but transaction is 67 bytes (DevDescriptor)
	transaction would be split into two parts:
	first one : with 64 bytes length
	second one : with 3 bytes length */
	uint32_t len;
	uint32_t residue;
	uint32_t pct_cnt;
		
	if(EndPoint[EPnum].txCounter < USB_CDC_MAX_PACKET_SIZE){
		len = EndPoint[EPnum].txCounter;
		residue = 0;
		pct_cnt = 1;
	}
	else{
		len = (EndPoint[EPnum].txCounter > max_tx_sz) ? max_tx_sz : EndPoint[EPnum].txCounter ; 
		residue = ((len % USB_CDC_MAX_PACKET_SIZE)==0) ? 0 : 1 ;
		pct_cnt = (uint32_t)((len/USB_CDC_MAX_PACKET_SIZE) + residue);
	}

	/************** Set Busy flag and start transmission *****************/

	EndPoint[EPnum].statusTx = EP_BUSY;	

	/************** data >= USB_CDC_MAX_PACKET_SIZE *****************/

