SvetlAl/STM32_LIN_FDCAN_TOOL/Firmware/Keil/template/Core/src/USB_CDC/stm32h7xx_usbdfs_cdc.c
	if(EndPoint[EPnum].txCounter >= USB_CDC_MAX_PACKET_SIZE){  /* counter >= 64 */
	
		USB_EP_IN(EPnum)->DIEPTSIZ = ((USB_OTG_DIEPTSIZ_PKTCNT_Msk & ((pct_cnt) << USB_OTG_DIEPTSIZ_PKTCNT_Pos))) /* One Packet */
		| ((USB_OTG_DIEPTSIZ_XFRSIZ_Msk & ((len) << USB_OTG_DIEPTSIZ_XFRSIZ_Pos)));			/* Max Size */
		USB_EP_IN(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_CNAK | USB_OTG_DIEPCTL_EPENA;
		
		while(write_Fifo(EPnum, EndPoint[EPnum].txBuffer_ptr, (uint16_t)len) == EP_FAILED ){
		
			recovery_routine_EP_IN(EPnum); 
			USB_EP_IN(EPnum)->DIEPTSIZ = 0;
			USB_EP_IN(EPnum)->DIEPTSIZ = ((USB_OTG_DIEPTSIZ_PKTCNT_Msk & ((pct_cnt) << USB_OTG_DIEPTSIZ_PKTCNT_Pos))) /* One Packet */
			| ((USB_OTG_DIEPTSIZ_XFRSIZ_Msk & ((len) << USB_OTG_DIEPTSIZ_XFRSIZ_Pos)));			/* Max Size */
			USB_EP_IN(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_CNAK | USB_OTG_DIEPCTL_EPENA;
			
			if((EPnum == 1) & check_free_space_inFifo(EPnum, EP1_MIN_DTFXSTS_LVL)){
				USB_FlushTxFifo(1, FLUSH_FIFO_TIMEOUT);
			}
		}			
		USB_FlushTxFifo(1, FLUSH_FIFO_TIMEOUT);  //TODO delete

		if(EndPoint[EPnum].txCounter==0 && residue == 0){ /* was this packet of MaxSize the last one in the queue ? ZLP required? */
			EndPoint[EPnum].statusTx = EP_ZLP; /* change EP TX status to ZLP, thereafter ZLP will be sent in sequential function call */
			while(is_epena_stuck(EPnum) != EP_OK){}
			send_zlp(EPnum);
			return EP_OK;
		}
	}
	/************** data <  USB_CDC_MAX_PACKET_SIZE *****************/

	else if(EndPoint[EPnum].txCounter < USB_CDC_MAX_PACKET_SIZE){
	
		USB_EP_IN(EPnum)->DIEPTSIZ = ((USB_OTG_DIEPTSIZ_PKTCNT_Msk & ((1) << USB_OTG_DIEPTSIZ_PKTCNT_Pos))) /* One Packet */
		| ((USB_OTG_DIEPTSIZ_XFRSIZ_Msk & ((uint32_t)(EndPoint[EPnum].txCounter) << USB_OTG_DIEPTSIZ_XFRSIZ_Pos)));	/*  Size */
		USB_EP_IN(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_CNAK | USB_OTG_DIEPCTL_EPENA;

		while(write_Fifo(EPnum, EndPoint[EPnum].txBuffer_ptr, (uint16_t)len) == EP_FAILED ){
			recovery_routine_EP_IN(EPnum); 
			USB_EP_IN(EPnum)->DIEPTSIZ = 0;
			USB_EP_IN(EPnum)->DIEPTSIZ = ((USB_OTG_DIEPTSIZ_PKTCNT_Msk & ((1) << USB_OTG_DIEPTSIZ_PKTCNT_Pos))) /* One Packet */
			| ((USB_OTG_DIEPTSIZ_XFRSIZ_Msk & ((uint32_t)(EndPoint[EPnum].txCounter) << USB_OTG_DIEPTSIZ_XFRSIZ_Pos)));			/* Max Size */
			USB_EP_IN(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_CNAK | USB_OTG_DIEPCTL_EPENA;

			if((EPnum == 1) & check_free_space_inFifo(EPnum, EP1_MIN_DTFXSTS_LVL)){
				USB_FlushTxFifo(1, FLUSH_FIFO_TIMEOUT);
			}
		}			
	//	USB_FlushTxFifo(1, FLUSH_FIFO_TIMEOUT);  //TODO delete
		clear_USB_device_status(DEVICE_STATE_TX_PR);		
	} 
		
	else{
		USB_EP_IN(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_CNAK;		
	}
	/************** finish transmission and set Ready flag  *****************/
	USB_EP_OUT(EPnum)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);
	EndPoint[EPnum].statusTx = EP_READY;
	clear_USB_device_status(DEVICE_STATE_TX_PR);
	return EP_OK;
}


/**
* brief  Set and start TX transaction
* param  EP number, TX Buffer, length 
* param 
* retval OK/FAILED
*/
uint32_t USB_CDC_setTxBuffer(uint8_t EPnum, uint8_t *txBuff, uint16_t len){
	/************** Previous transaction is not finished ****************/
	if((EndPoint[EPnum].txCounter != 0) || (EndPoint[EPnum].statusTx == EP_ZLP) || (check_USB_device_status(DEVICE_STATE_TX_PR) == EP_OK)){				
		return EP_FAILED;
	}

	/************** length exceeds max TX size in user settings ****************/
	uint32_t max_transfer_sz;
	if(EPnum == 0){
		max_transfer_sz = MAX_CDC_EP0_TX_SIZ + (USB_CDC_MAX_PACKET_SIZE - 1);
	}
	else max_transfer_sz = MAX_CDC_EP1_TX_SIZ + (USB_CDC_MAX_PACKET_SIZE - 1);
	
	if(len > max_transfer_sz) return EP_FAILED;
	
	/************** All conditions are OK ****************/
	
	if(len!=0){	/* Set data to send */	
//		USB_EP_IN(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_SD0PID_SEVNFRM;
		EndPoint[EPnum].txBuffer_ptr = txBuff;
		EndPoint[EPnum].txCounter = len;

		/* Send data */			
		set_device_status(DEVICE_STATE_TX_PR);
		EndPoint[EPnum].txCallBack(EPnum);
		
		return EP_OK;
	}
	
	else{ /* Zero-Length Packet */		
		USB_EP_IN(EPnum)->DIEPTSIZ = 0;
		USB_EP_IN(EPnum)->DIEPTSIZ = ((USB_OTG_DIEPTSIZ_PKTCNT_Msk & ((1) << USB_OTG_DIEPTSIZ_PKTCNT_Pos))); /* One Packet */
		USB_EP_IN(EPnum)->DIEPTSIZ &= ~USB_OTG_DIEPTSIZ_XFRSIZ_Msk;  /* Zero Length */
		USB_EP_IN(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_CNAK | USB_OTG_DIEPCTL_EPENA;
	
		USB_EP_OUT(EPnum)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);
		return EP_OK;
	}
}

/**
* brief  Perform some action with received data (EP0) and refresh EP buffer counter
* brief  For EP0 - Set lineCoding
* param  command 
* param 
* retval 
*/

uint32_t USB_CDC_transferRXCallback_EP0(uint32_t param){
	uint16_t len = EndPoint[0].rxCounter;	
	if(len==0) return EP_OK;
	if(EndPoint[0].statusRx == EP_BUSY) return EP_FAILED;
	
	if(param == CDC_SET_LINE_CODING){
		
		toggle_Rx_EP_Status(0, EP_BUSY);
		
		uint8_t *data = EndPoint[0].rxBuffer_ptr - EndPoint[0].rxCounter;
		EndPoint[0].rxBuffer_ptr = data;
		uint8_t new_linecoding_settings[CDC_LINE_CODING_LENGTH];  
		
		for(int i = 0; i < len; i++){
			new_linecoding_settings[i] = *data++;
			EndPoint[0].rxCounter--;
		}
			
		// line coding 00 C2 01 00000000 000000000000 08
		for(uint32_t i = 0; i < CDC_LINE_CODING_LENGTH; i++){
			if(i==6 && lineCoding[i]==0x08){lineCoding[i] = 0x08;}
		else
			lineCoding[i] = new_linecoding_settings[i];
		}	
			/* Toggle EP RX status */
		toggle_Rx_EP_Status(0, EP_READY);
	}
	return EP_OK;
}

/*******************************************************************************************************/
/*******************************************************************************************************/
/******************** THIS IS A DEMO HOW TO IMPLEMENT OUT EP + CIRCULAR BUF  ***************************/	
/*******************************************************************************************************/
/*******************************************************************************************************/

/**
* brief  Perform some action with received data (EP1) and refresh EP buffer counter
* brief  Test function works as echo and shows number of received bytes
* param  a command or a dummy param
* param 
* retval 
*/

__WEAK uint32_t USB_CDC_transferRXCallback_EP1(uint32_t param){
	if(EndPoint[1].statusRx == EP_BUSY) return EP_FAILED;
	/* Toggle EP RX status */
//	toggle_Rx_EP_Status(1, EP_BUSY);
			
	/* CircBufferTest */
 	uint16_t len = EndPoint[1].rxCounter;
	/* CircBufferTest */	
		
/*******************************************************************************************************/
/******** This is a demonstration of both  EndPoint[1].rxCounter ***************************************/	
/******** and circular buffer, for Echo only you don't need to use rxCounter ***************************/	
/******** , you can write in circular buffer you can write directly in write_fifo() function ***********/
/*******************************************************************************************************/	
	
	/* reset RX counter and buffer pointer */
 	EndPoint[1].rxBuffer_ptr -= EndPoint[1].rxCounter;
	EndPoint[1].rxCounter = 0;	
	
	/* CircBufferTest */
 //	write_to_circBuffer(EndPoint[1].rxBuffer_ptr, len);
	/* CircBufferTest */
	USB_CDC_receive_data(len);

