SvetlAl/STM32_LIN_FDCAN_TOOL/Firmware/Keil/template/Core/src/USB_CDC/stm32h7xx_usbdfs_cdc.c
	USB_EP_OUT(1)->DOEPTSIZ = 0;			
	USB_EP_OUT(1)->DOEPTSIZ |= (USB_OTG_DOEPTSIZ_PKTCNT & (DOEPT_TRANSFER_PCT << USB_OTG_DOEPTSIZ_PKTCNT_Pos)); 
	USB_EP_OUT(1)->DOEPTSIZ |= DOEPT_TRANSFER_SIZE; 
	USB_EP_OUT(1)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);
	
	/* Toggle EP RX status */
//	toggle_Rx_EP_Status(1, EP_READY);

	return param;
}

/***************************************************
*
* 			USB enumeration
*
***************************************************/

/**
* brief  USB reset handler 
* param  
* param 
* retval 
*/

void enumerate_Reset(){
	on_reset();
	device_state = DEVICE_STATE_RESET;  
	USB1_OTG_HS->GINTSTS &= ~0xFFFFFFFF;
	
	USB_OTG_DEVICE->DAINTMSK = 0x30003;
	 /* Unmask interrupts IEPM, OEPM for EP0, EP1 ,   IEPM for EP2*/
	USB_OTG_DEVICE->DOEPMSK  = USB_OTG_DOEPMSK_STUPM | USB_OTG_DOEPMSK_XFRCM; /* Unmask SETUP Phase done Mask,  TransfeR Completed interrupt for OUT */
	USB_OTG_DEVICE->DIEPMSK  =  /* USB_OTG_DIEPMSK_ITTXFEMSK | */ USB_OTG_DIEPMSK_XFRCM; /* TransfeR Completed interrupt for IN */
    
	/* Flush All Fifos */
	USB_FlushTxFifo(0xF, FLUSH_FIFO_TIMEOUT); 
	USB_FlushRxFifo(FLUSH_FIFO_TIMEOUT); 
	
	USB_OTG_DEVICE->DCFG  &= ~USB_OTG_DCFG_DAD_Msk;  /* before Enumeration set address 0 */


	/* Endpoint 1 */
	USB_EP_IN(1)->DIEPCTL = USB_OTG_DIEPCTL_SNAK |	
				USB_OTG_DIEPCTL_TXFNUM_0 |  /* TX Number 1 */
				USB_OTG_DIEPCTL_EPTYP_1 |  /* Eptype 10 means Bulk */
				USB_OTG_DIEPCTL_USBAEP |  /* Set Endpoint active */
				USB_CDC_MAX_PACKET_SIZE;  /* Max Packet size (bytes) */ 
	
	USB_EP_OUT(1)->DOEPCTL = USB_OTG_DOEPCTL_EPENA | 	/* Enable Endpoint */
				USB_OTG_DOEPCTL_CNAK |  /* Clear NAK */
				USB_OTG_DOEPCTL_EPTYP_1 |  /* Eptype 10 means Bulk */
				USB_OTG_DOEPCTL_USBAEP | /* Set Endpoint active */
				USB_CDC_MAX_PACKET_SIZE; /* CHK MPSIZ The application must program this field with the maximum packet size for the current logical endpoint. This value is in bytes */

	USB_EP_OUT(1)->DOEPTSIZ = 0;			
	USB_EP_OUT(1)->DOEPTSIZ |= (USB_OTG_DOEPTSIZ_PKTCNT & (DOEPT_TRANSFER_PCT << USB_OTG_DOEPTSIZ_PKTCNT_Pos)); /* RM quote: Indicates the total number of USB packets that constitute the Transfer Size amount of data for this endpoint. This field is decremented every time a packet (maximum size or short packet) is written to the RxFIFO */

	USB_EP_OUT(1)->DOEPTSIZ |= DOEPT_TRANSFER_SIZE; /* Transfer size. If you set transfer size = max. packet, the core will interrupt the application at the end of each packet */
	
	/* Endpoint 2 */
	USB_EP_IN(2)->DIEPCTL = USB_OTG_DIEPCTL_SNAK |
				USB_OTG_DIEPCTL_TXFNUM_1 | 
				USB_OTG_DIEPCTL_EPTYP |  // Eptype 11 means Interrupt EP 
				USB_OTG_DIEPCTL_USBAEP | 
				0x08; 
																									
}

/**
* brief  Handle all host requests, send all descriptors data
* param  
* param 
* retval 
*/
void enumerate_Setup(){
	uint16_t len = setup_pkt_data.setup_pkt.wLength;
	uint8_t dest[128]={0};
			
	switch(setup_pkt_data.setup_pkt.wRequest){
		
		case REQ_TYPE_HOST_TO_DEVICE_GET_DEVICE_DECRIPTOR:
			switch(setup_pkt_data.setup_pkt.wValue){
				case DESCRIPTOR_TYPE_DEVICE: 				/* Request 0x0680  Value 0x0100 */
					if(DEVICE_DESCRIPTOR_LENGTH < len) len = DEVICE_DESCRIPTOR_LENGTH;
					memcpy(&dest, &deviceDescriptor, len);
					break;
				case DESCRIPTOR_TYPE_CONFIGURATION: 			/* Request 0x0680  Value 0x0200 */
					if(CONFIGURATION_DESCRIPTOR_LENGTH < len) len = CONFIGURATION_DESCRIPTOR_LENGTH;
					memcpy(&dest, &configurationDescriptor, len);
					break;    
				case DESCRIPTOR_TYPE_DEVICE_QUALIFIER: 			/* Request 0x0680  Value 0x0600 */
					if(DEVICE_QUALIFIER_LENGTH < len) len = DEVICE_QUALIFIER_LENGTH; 
					memcpy(&dest, &deviceQualifierDescriptor, len);
					//	return; /* CUBE MX CDC actually doesn't send any data here */
					break;          
				case DESCRIPTOR_TYPE_LANG_STRING: 			/* Request 0x0680  Value 0x0300 */
					if(LANG_DESCRIPTOR_LENGTH < len) len = LANG_DESCRIPTOR_LENGTH;   
					memcpy(&dest, &languageStringDescriptor, len);				
					break; 
				case DESCRIPTOR_TYPE_MFC_STRING: 			/* Request 0x0680  Value 0x0301 */
					if(MFC_DESCRIPTOR_LENGTH < len) len = MFC_DESCRIPTOR_LENGTH;
					memcpy(&dest, &manufactorStringDescriptor, len);				
					break;
				case DESCRIPTOR_TYPE_PROD_STRING: 			/* Request 0x0680  Value 0x0302 */
					if(PRODUCT_DESCRIPTOR_LENGTH < len) len = PRODUCT_DESCRIPTOR_LENGTH;
					memcpy(&dest, &productStringDescriptor, len);				
					break;                     
				case DESCRIPTOR_TYPE_SERIAL_STRING: 			/* Request 0x0680  Value 0x0303 */
					if(SERIAL_DESCRIPTOR_LENGTH < len) len = SERIAL_DESCRIPTOR_LENGTH;
					memcpy(&dest, &serialNumberStringDescriptor, len);
					break;
				case DESCRIPTOR_TYPE_CONFIGURATION_STRING: 		/* Request 0x0680  Value 0x0304 */
					if(CONFIG_STRING_LENGTH < len) len = CONFIG_STRING_LENGTH;					
					memcpy(&dest, &configurationStringDescriptor, len);
					break;
				case DESCRIPTOR_TYPE_INTERFACE_STRING: 			/* Request 0x0680  Value 0x0305 */
					if(INTERFACE_STRING_LENGTH < len) len = INTERFACE_STRING_LENGTH;
					memcpy(&dest, &stringInterface, len);
					break;
				default:
					return;
			}
			break;
			
		case REQ_TYPE_DEVICE_TO_HOST_SET_ADDRESS: 				/* Request 0x0500  */
			USB_OTG_DEVICE->DCFG |= (uint32_t)(setup_pkt_data.setup_pkt.wValue << 4);
			set_device_status(DEVICE_STATE_ADDRESSED);
			// device_state = DEVICE_STATE_ADDRESSED;
			break;
		case REQ_TYPE_DEVICE_TO_HOST_SET_CONFIGURATION: 			/* Request 0x0900  */
			len=0; /* ZLP */
			/* TODO: set configuration */
			break;     
		
		case CDC_GET_LINE_CODING: 						/* Request 0x21A1  */
			if(CDC_LINE_CODING_LENGTH < len) len = CDC_LINE_CODING_LENGTH;
			memcpy(&dest, &lineCoding, len);
			set_device_status(DEVICE_STATE_LINECODED);
			break;
		
		case CDC_SET_LINE_CODING: 						/* Request 0x2021  */
			len=0;		
			EndPoint[0].rxCallBack(CDC_SET_LINE_CODING); //TODO
			break;       
		case CDC_SET_CONTROL_LINE_STATE: 					/* Request 0x2221  */
			len=0;	
			break;	
		case CLEAR_FEATURE_ENDP: 						/* Request 0x0201  */
			return;
		default:
			break;
	} 
	
	EndPoint[0].setTxBuffer(0, dest, len);
}


/**
* brief  Schedule a new transmission after a previous one finished
* param  
* param 
* retval EP_FAILED if conditions are not met & (USB_EP_IN(1)->DIEPINT & USB_OTG_DIEPINT_TXFE)
*/

uint32_t USB_CDC_transmit_scheduler(){
	if((is_tx_ep_fifo_ready(1, 1) == EP_OK) & (is_circBuffer_empty() !=0 )){

		circBufferAddress newMsgaddr = read_circBuffer(MAX_CDC_EP1_TX_SIZ);
		EndPoint[1].setTxBuffer(1, &circBufferTx[newMsgaddr.index], newMsgaddr.len /*newMsg.len*/);
		return EP_OK;
	}

