SvetlAl/STM32_LIN_FDCAN_TOOL/Firmware/Keil/template/Core/src/USB_CDC/stm32h7xx_usbdfs_cdc.c
	return EP_FAILED; 
}

extern void OTG_HS_IRQHandler(void);
void OTG_HS_IRQHandler(){
	/**************************************************************/	
	/****************** Start of Frame event **********************/
	/**************************************************************/
	if(USB1_OTG_HS->GINTSTS & USB_OTG_GINTSTS_SOF){ 

		USB_CDC_transmit_scheduler();

		USB_CLEAR_INTERRUPT(USB_OTG_GINTSTS_SOF);  	
		return;
	}
	
	/**************************************************************/	
	/****************** ENUMDNEM event ****************************/
	/**************************************************************/
	/*	if(USB_OTG_FS->GINTSTS & USB_OTG_GINTSTS_ENUMDNE){  
		USB_CLEAR_INTERRUPT(USB_OTG_GINTSTS_ENUMDNE);   
   		 device_state = DEVICE_STATE_READY;

    		return;
  }*/
	
	/**************************************************************/	
	/****************** USBRST Reset event ************************/
	/**************************************************************/
	if(USB1_OTG_HS->GINTSTS & USB_OTG_GINTSTS_USBRST){  
		USB_CLEAR_INTERRUPT(USB_OTG_GINTSTS_USBRST);   
		enumerate_Reset();
		return;
	 }
	
	if(USB1_OTG_HS->GINTSTS & USB_OTG_GINTSTS_USBSUSP){  
		USB_CLEAR_INTERRUPT(USB_OTG_GINTSTS_USBSUSP);
		USB1_OTG_HS->GINTMSK = USB_OTG_GINTMSK_USBRST;
		return;
	 }
	if(USB1_OTG_HS->GINTSTS & USB_OTG_GINTSTS_ESUSP){  
		USB_CLEAR_INTERRUPT(USB_OTG_GINTSTS_ESUSP);
		USB1_OTG_HS->GINTMSK = USB_OTG_GINTMSK_USBRST;
		return;
	 }
	/**************************************************************/
	/*************** IN endpoint event ****************************/
	/**************************************************************/
	
	if(USB1_OTG_HS->GINTSTS & USB_OTG_GINTSTS_IEPINT){  /* IN endpoint event */	
		uint32_t epnums  = USB_OTG_DEVICE->DAINT; /* Read out EndPoint INTerrupt bits */

		if(epnums & 0x0001){				/* EndPoint INTerrupt bits correspond to EP0 IN*/
			uint32_t IN_interrupt = USB_EP_IN(0)->DIEPINT; /* Read out EP interrupt bit */

			if(IN_interrupt & USB_OTG_DIEPINT_XFRC){  /* Transfer completed interrupt. */ 
				EndPoint[0].txCallBack(0);									/* Process TX transmission (if TX buffer is not empty) */
			}
			USB_CLEAR_INTERRUPT(USB_OTG_GINTSTS_IEPINT);	
			CLEAR_IN_EP_INTERRUPT(0, IN_interrupt);
		}

		if( epnums & 0x0002){ /* EndPoint INTerrupt bits correspond to EP1 IN*/
			uint32_t IN_interrupt = USB_EP_IN(1)->DIEPINT;

			if(IN_interrupt & USB_OTG_DIEPINT_XFRC){  /* Transfer completed interrupt.*/ 

				EndPoint[1].txCallBack(1);			/* Process TX transmission (if TX buffer is not empty) */

				USB_CLEAR_INTERRUPT(USB_OTG_GINTSTS_IEPINT);	
				CLEAR_IN_EP_INTERRUPT(1, USB_OTG_DIEPINT_XFRC);			
			}
		}
		return;
	}
	/***************************************************************/
	/*************** OUT endpoint event ****************************/
	/***************************************************************/
	
	if(USB1_OTG_HS->GINTSTS & USB_OTG_GINTSTS_OEPINT){ /* OUT endpoint event */
		USB_CLEAR_INTERRUPT(USB_OTG_GINTSTS_OEPINT);	
		uint32_t epnums  = USB_OTG_DEVICE->DAINT;    /* Read out EndPoint INTerrupt bits */
		
	/****************** 		EP 0 			*****************************/
		if( epnums & 0x00010000){ /* EndPoint INTerrupt bits correspond to EP0 OUT */  
			uint32_t epint = USB_EP_OUT(0)->DOEPINT; /* Read out Endpoint Interrupt register for EP0 */
						
			if(epint & USB_OTG_DOEPINT_STUP){		/* Setup packet received */ 			
				enumerate_Setup();				
				}
			if(epint & USB_OTG_DOEPINT_XFRC){
				EndPoint[0].rxCallBack(0); //TODO
							/* CNAK and EPENA must be set again after every interrupt to let this EP receive upcoming data */		
				USB_EP_OUT(0)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);	
			}
			CLEAR_OUT_EP_INTERRUPT(0, epint);
		}

	/****************** 		EP 1  			*****************************/		
		if( epnums & 0x00020000){ /* EndPoint INTerrupt bits correspond to EP1 OUT */
			uint32_t epint = USB_EP_OUT(1)->DOEPINT; /* Read out Endpoint Interrupt register for EP0 */
			
			if(epint & USB_OTG_DOEPINT_XFRC){	
												
				EndPoint[1].rxCallBack(EP_OK);	
				/* CNAK and EPENA must be set again after every interrupt to let this EP receive upcoming data */
				USB_EP_OUT(1)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);
				
			}
			CLEAR_OUT_EP_INTERRUPT(1, epint);		
		}   				
		return;
	}

	/***************************************************************/
	/********************* RXFLVL event ****************************/
	/***************************************************************/  
	if(USB1_OTG_HS->GINTSTS & USB_OTG_GINTSTS_RXFLVL){ /* RX fifo not empty event */
		uint32_t temp = USB1_OTG_HS->GRXSTSP;   /* Read out PacKeT STatuS */ 
		USB_MASK_INTERRUPT(USB_OTG_GINTSTS_RXFLVL); 
		
	/********************* Some data for (EP0, EP1) ****************************/
		if(((temp & USB_OTG_GRXSTSP_PKTSTS) >> 17) ==  STS_DATA_UPDT){ /* 0010: OUT data packet received */ 
		
			if(temp & USB_OTG_GRXSTSP_BCNT){ /* Byte count > 0 ??? */ 
				uint16_t length = ((temp & USB_OTG_GRXSTSP_BCNT) >> USB_OTG_GRXSTSP_BCNT_Pos);
				uint8_t EpNum =	((temp & USB_OTG_GRXSTSP_EPNUM) >> USB_OTG_GRXSTSP_EPNUM_Pos);

				read_Fifo(EpNum, length); /*  Read data from DFIFO  */
			}
		}
		/********************* SETUP PACKET for EP0 ****************************/
		else  if(((temp & USB_OTG_GRXSTSP_PKTSTS) >> 17) ==  STS_SETUP_UPDT){  /* 0110: SETUP data packet received */
			read_Setup_Fifo();
		} 
		USB_UNMASK_INTERRUPT(USB_OTG_GINTSTS_RXFLVL); 
		return;
  }  
}





/************************************************************/
/*************************** inline *************************/
/************************************************************/


/**
* brief  This function is called to ensure that data is written in TX FIFO properly 
* param  EP number, minimum free TX FIFO level
* param  
* retval 
*/
static inline uint32_t DTFXSTS_timeout(uint8_t Epnum, uint32_t dtxfsts_val){
	
	if(Epnum ==0) return EP_OK;

	volatile uint32_t count = 0;
	do{
		if (++count > DTFXSTS_TIMEOUT){
			//return EP_FAILED;
			USB_FlushTxFifo(0x10, FLUSH_FIFO_TIMEOUT);
			USB_FlushRxFifo(FLUSH_FIFO_TIMEOUT);
			return EP_FAILED;
		}
	} while (!(USB_EP_IN(Epnum)->DTXFSTS == dtxfsts_val));

	return EP_OK;
}

static inline uint32_t check_free_space_inFifo(uint8_t dfifo, uint32_t space){
	if(USB_EP_IN(dfifo)->DTXFSTS >= space){
		return EP_OK;
	}
	else return EP_FAILED;
}


static inline uint32_t is_epena_stuck(uint8_t EPnum){
	if((USB_EP_IN(EPnum)->DIEPCTL & USB_OTG_DIEPCTL_EPENA)  &  				/* EPENA stuck */
		!(USB_EP_IN(EPnum)->DIEPTSIZ & USB_OTG_DIEPTSIZ_XFRSIZ) &			/* no data pending */
		((USB_EP_IN(EPnum)->DIEPTSIZ & USB_OTG_HCTSIZ_PKTCNT) != 0)){		/* packet count pending */
			
