SvetlAl/STM32_LIN_FDCAN_TOOL/Firmware/Keil/template/Core/src/USB_CDC/stm32h7xx_usbdfs_cdc.c
		return EP_FAILED;
	}
	else return EP_OK;
}

/**
* brief  If IN endpoint is busy and some data is stuck in TX FIFO 
* brief  this procedure is called to handle this event
* param  EP number
* param  
* retval 
*/

static inline uint32_t recovery_routine_EP_IN (uint8_t EPnum){
	if((EPnum ==1) & (is_epena_stuck (1) == EP_FAILED)){
		USB_EP_IN(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_EPDIS;
		USB_EP_IN(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_SNAK;
		USB_EP_IN(EPnum)->DIEPTSIZ =0;			
		return EP_OK;
	}
	return EP_FAILED;
}
/**
* brief  Device status functions. Set/clear/check
* param  
* param  
* retval 
*/
static inline void set_device_status(eDeviceState state){
	device_state |= state;
}

void clear_USB_device_status(eDeviceState state){
	device_state &= ~(uint32_t)state;
}

uint32_t check_USB_device_status(eDeviceState state){
	if(device_state & state){
		return EP_OK;
	}
	else return EP_FAILED;
}

/**
* brief  Check if TX FIFO is ready to push there data
* param  EP number
* param  param. If you use TX queue, "param" would be message count var pending in the queue
* param  if you have a var like message_counter, you use it here, otherwise use something > 0
* retval 
*/
static inline uint32_t is_tx_ep_fifo_ready(uint8_t EPnum, uint32_t param){
	if((param > 0) & !(device_state & DEVICE_STATE_TX_PR) &
		!(USB_EP_IN(EPnum)->DIEPTSIZ & USB_OTG_DIEPTSIZ_XFRSIZ) &
		((USB_EP_IN(EPnum)->DIEPTSIZ & USB_OTG_HCTSIZ_PKTCNT) == 0) &
		!(USB_EP_IN(EPnum)->DIEPCTL & USB_OTG_DIEPCTL_EPENA)  &
		((USB_EP_IN(EPnum)->DIEPINT & USB_OTG_DIEPINT_TXFE) != 0)){
		
		return EP_OK;
	}
	else return EP_FAILED;
}
/**
* brief  This function monitors SOF messages numbers to see if a "host to device" connection is establiched
* param  
* param 
* param 
* retval OK/FAIL
*/
eLinkState USB_CDC_process_watchdog(){
	if(!(check_USB_device_status(DEVICE_STATE_ADDRESSED))) return LINK_STATE_DEFAULT;
	
	static uint32_t last_usb_frame_watchdog = 0; 
	uint32_t current_usb_frame_watchdog = USB_OTG_DEVICE->DSTS & USB_OTG_DSTS_FNSOF_Msk;
	
	if(current_usb_frame_watchdog != last_usb_frame_watchdog){
		last_usb_frame_watchdog = current_usb_frame_watchdog;
		return LINK_STATE_CONNECTED;
	}
	else{
		clear_USB_device_status(DEVICE_STATE_ADDRESSED);
		return LINK_STATE_DISCONNECTED;
	}
}



/* @TODO update */
uint32_t USB_CDC_send_data(uint8_t *txBuff, uint16_t len){
	if(len==0) return EP_OK;
	
	if(get_circBuffer_freeSize() < len) return EP_FAILED;
	else{
		write_to_circBuffer(txBuff, len);
		return EP_OK;
	}
}


uint32_t USB_CDC_send_array(uint8_t *txBuff, uint16_t len){
	if(len == 0) return EP_FAILED;
	uint16_t pos = 0;
	uint16_t data_to_send = len;
	
	while((data_to_send > MAX_CDC_EP1_TX_SIZ) && (pos < len )){
		USB_CDC_send_data(&txBuff[pos], MAX_CDC_EP1_TX_SIZ);
		data_to_send = (uint16_t)(data_to_send - MAX_CDC_EP1_TX_SIZ);
		pos = (uint16_t)(pos + MAX_CDC_EP1_TX_SIZ);
	}
	if(data_to_send == 0) return EP_OK;
	
	USB_CDC_send_data(&txBuff[pos], data_to_send);
	return EP_OK;
}

/* @TODO update */
uint32_t USB_CDC_send_2data(uint8_t *txBuff, uint16_t len, uint8_t *txBuff2, uint16_t len2){	

	if(get_circBuffer_freeSize() < (len + len2)) return EP_FAILED;
	else{
		write_to_circBuffer(txBuff, len);
		write_to_circBuffer(txBuff2, len2);
		return EP_OK;
	}
}


/* it is recommended to store RX data in a buffer and process the data in a main loop or separated task */
__WEAK uint32_t USB_CDC_receive_data(uint16_t length){
//	uint8_t *data = EndPoint[1].rxBuffer_ptr;
//	return EP_OK;
	return length;
}
#endif // USB_PERIPH_HS_IN_FS_MODE
